name = ['戚淑英','楚健','赵畅','徐凯','任明','颜欣','王梅','刘淑华','朱东','杨丹','赵红','孙宁','潘金凤','陈璐','梁欢','郑秀兰','马敏','汤磊','石红霞','李洁']
sfz = [130529196808119378,510182199908103132,420683193511127173,610528199705109494,520402200007201335,610222194807044620,150204195408081994,130000196407018154,530723193707211697,430822197403014348,320611195205249141,440804194205056024,441702199312236122,530427199705054137,420607195301045615,331121194902103264,532529193801052521,451200196010281765,511422194111285432,652300193711151984]
phone = [13132703696,13514463239,15750455748,13999494492,15121931496,18220917749,14565931707,15138966344,13954810343,18616072229,15817299837,15541402783,13452689734,13113870476,13678775275,13940477936,15167656169,13502403478,14717037199,14718541937]
prov = ['北京市','重庆市','河南省','天津市','贵州省','辽宁省','北京市','辽宁省','宁夏回族自治区','江苏省','天津市','云南省','山东省','香港特别行政区','上海市','香港特别行政区','广东省','吉林省','澳门特别行政区','河南省']
city = ['东莞县','玉珍市','六安县','丽丽县','兴城市','莉县','潜江县','东莞市','海门市','刚县','成都县','关岭县','杭州市','桂兰县','广州县','娟县','潜江市','南京市','长春县','荆门县']
dis = ['沈北新','海陵','涪城','沙湾','大兴','和平','秀英','安次','友好','锡山','门头沟','高港','江北','沙湾','浔阳','孝南','静安','东丽','华龙','长寿']

import openpyxl as op

def op_toexcel(data,filename): # openpyxl库储存数据到excel
    wb = op.Workbook() # 创建工作簿对象
    ws = wb['Sheet'] # 创建子表
    ws.append(['姓名', '身份证', '电话号', '省', '市', '地区']) # 添加表头
    for i in range(len(data[0])):
        d = data[0][i], data[1][i], data[2][i], data[3][i], data[4][i], data[5][i]
        ws.append(d) # 每次写入一行
    wb.save(filename)

if __name__ == '__main__':
    data = [name, sfz, phone, prov, city, dis]
    filename = '随机信息.xlsx'
    op_toexcel(data, filename)






